xsession/openocd/svd/ti/tms320f28069.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA Registers</description>
      <groupName>DMA</groupName>
      <baseAddress>0x00002000</baseAddress>
      <registers>
        <register>
          <name>DMACTRL</name>
          <description>DMA Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DEBUGCTRL</name>
          <description>Debug Control Register</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>REVISION</name>
          <description>Peripheral Revision Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PRIORITYCTRL1</name>
          <description>Priority Control Register 1</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PRIORITYSTAT</name>
          <description>Priority Status Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_MODE</name>
          <description>DMA Channel 1 Mode Register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_CONTROL</name>
          <description>DMA Channel 1 Control Register</description>
          <addressOffset>0x00000042</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_BURST_SIZE</name>
          <description>DMA Channel 1 Burst Size Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_BURST_COUNT</name>
          <description>DMA Channel 1 Burst Count Register</description>
          <addressOffset>0x00000046</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_BURST_STEP</name>
          <description>DMA Channel 1 Source Burst Step Size Register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_BURST_STEP</name>
          <description>DMA Channel 1 Destination Burst Step Size Register</description>
          <addressOffset>0x0000004A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_TRANSFER_SIZE</name>
          <description>DMA Channel 1 Transfer Size Register</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_TRANSFER_COUNT</name>
          <description>DMA Channel 1 Transfer Count Register</description>
          <addressOffset>0x0000004E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 1 Source Transfer Step Size Register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_TRANSFER_STEP</name>
          <description>DMA Channel 1 Destination Transfer Step Size Register</description>
          <addressOffset>0x00000052</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_WRAP_SIZE</name>
          <description>DMA Channel 1 Source Wrap Size Register</description>
          <addressOffset>0x00000054</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_WRAP_COUNT</name>
          <description>DMA Channel 1 Source Wrap Count Register</description>
          <addressOffset>0x00000056</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_WRAP_STEP</name>
          <description>DMA Channel 1 Source Wrap Step Size Register</description>
          <addressOffset>0x00000058</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_WRAP_SIZE</name>
          <description>DMA Channel 1 Destination Wrap Size Register</description>
          <addressOffset>0x0000005A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_WRAP_COUNT</name>
          <description>DMA Channel 1 Destination Wrap Count Register</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_WRAP_STEP</name>
          <description>DMA Channel 1 Destination Wrap Step Size Register</description>
          <addressOffset>0x0000005E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 1 Shadow Source Begin Register</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 1 Shadow Source Current Address Register</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 1 Active Source Begin Register</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 1 Active Source Current Address Register</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 1 Shadow Destination Begin Register</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_ADDR_SHADOW</name>
          <description>DMA Channel 1 Shadow Destination Current Address Register</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 1 Active Destination Begin Register</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 1 Active Destination Current Address Register</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_MODE</name>
          <description>DMA Channel 2 Mode Register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_CONTROL</name>
          <description>DMA Channel 2 Control Register</description>
          <addressOffset>0x00000082</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_BURST_SIZE</name>
          <description>DMA Channel 2 Burst Size Register</description>
          <addressOffset>0x00000084</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_BURST_COUNT</name>
          <description>DMA Channel 2 Burst Count Register</description>
          <addressOffset>0x00000086</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_BURST_STEP</name>
          <description>DMA Channel 2 Source Burst Step Size Register</description>
          <addressOffset>0x00000088</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_BURST_STEP</name>
          <description>DMA Channel 2 Destination Burst Step Size Register</description>
          <addressOffset>0x0000008A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_TRANSFER_SIZE</name>
          <description>DMA Channel 2 Transfer Size Register</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_TRANSFER_COUNT</name>
          <description>DMA Channel 2 Transfer Count Register</description>
          <addressOffset>0x0000008E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 2 Source Transfer Step Size Register</description>
          <addressOffset>0x00000090</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_TRANSFER_STEP</name>
          <description>DMA Channel 2 Destination Transfer Step Size Register</description>
          <addressOffset>0x00000092</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_WRAP_SIZE</name>
          <description>DMA Channel 2 Source Wrap Size Register</description>
          <addressOffset>0x00000094</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_WRAP_COUNT</name>
          <description>DMA Channel 2 Source Wrap Count Register</description>
          <addressOffset>0x00000096</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_WRAP_STEP</name>
          <description>DMA Channel 2 Source Wrap Step Size Register</description>
          <addressOffset>0x00000098</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_WRAP_SIZE</name>
          <description>DMA Channel 2 Destination Wrap Size Register</description>
          <addressOffset>0x0000009A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_WRAP_COUNT</name>
          <description>DMA Channel 2 Destination Wrap Count Register</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_WRAP_STEP</name>
          <description>DMA Channel 2 Destination Wrap Step Size Register</description>
          <addressOffset>0x0000009E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 2 Shadow Source Begin Register</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 2 Shadow Source Current Address Register</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 2 Active Source Begin Register</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 2 Active Source Current Address Register</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 2 Shadow Destination Begin Register</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_ADDR_SHADOW</name>
          <description>DMA Channel 2 Shadow Destination Current Address Register</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 2 Active Destination Begin Register</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 2 Active Destination Current Address Register</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_MODE</name>
          <description>DMA Channel 3 Mode Register</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_CONTROL</name>
          <description>DMA Channel 3 Control Register</description>
          <addressOffset>0x000000C2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_BURST_SIZE</name>
          <description>DMA Channel 3 Burst Size Register</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_BURST_COUNT</name>
          <description>DMA Channel 3 Burst Count Register</description>
          <addressOffset>0x000000C6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_BURST_STEP</name>
          <description>DMA Channel 3 Source Burst Step Size Register</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_BURST_STEP</name>
          <description>DMA Channel 3 Destination Burst Step Size Register</description>
          <addressOffset>0x000000CA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_TRANSFER_SIZE</name>
          <description>DMA Channel 3 Transfer Size Register</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_TRANSFER_COUNT</name>
          <description>DMA Channel 3 Transfer Count Register</description>
          <addressOffset>0x000000CE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 3 Source Transfer Step Size Register</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_TRANSFER_STEP</name>
          <description>DMA Channel 3 Destination Transfer Step Size Register</description>
          <addressOffset>0x000000D2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_WRAP_SIZE</name>
          <description>DMA Channel 3 Source Wrap Size Register</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_WRAP_COUNT</name>
          <description>DMA Channel 3 Source Wrap Count Register</description>
          <addressOffset>0x000000D6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
