xsession/openocd/svd/ti/tms320f28069.svd
        <register>
          <name>DMACH3_SRC_WRAP_STEP</name>
          <description>DMA Channel 3 Source Wrap Step Size Register</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_WRAP_SIZE</name>
          <description>DMA Channel 3 Destination Wrap Size Register</description>
          <addressOffset>0x000000DA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_WRAP_COUNT</name>
          <description>DMA Channel 3 Destination Wrap Count Register</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_WRAP_STEP</name>
          <description>DMA Channel 3 Destination Wrap Step Size Register</description>
          <addressOffset>0x000000DE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 3 Shadow Source Begin Register</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 3 Shadow Source Current Address Register</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 3 Active Source Begin Register</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 3 Active Source Current Address Register</description>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 3 Shadow Destination Begin Register</description>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_ADDR_SHADOW</name>
          <description>DMA Channel 3 Shadow Destination Current Address Register</description>
          <addressOffset>0x000000F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 3 Active Destination Begin Register</description>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 3 Active Destination Current Address Register</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_MODE</name>
          <description>DMA Channel 4 Mode Register</description>
          <addressOffset>0x00000100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_CONTROL</name>
          <description>DMA Channel 4 Control Register</description>
          <addressOffset>0x00000102</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_BURST_SIZE</name>
          <description>DMA Channel 4 Burst Size Register</description>
          <addressOffset>0x00000104</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_BURST_COUNT</name>
          <description>DMA Channel 4 Burst Count Register</description>
          <addressOffset>0x00000106</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_BURST_STEP</name>
          <description>DMA Channel 4 Source Burst Step Size Register</description>
          <addressOffset>0x00000108</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_BURST_STEP</name>
          <description>DMA Channel 4 Destination Burst Step Size Register</description>
          <addressOffset>0x0000010A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_TRANSFER_SIZE</name>
          <description>DMA Channel 4 Transfer Size Register</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_TRANSFER_COUNT</name>
          <description>DMA Channel 4 Transfer Count Register</description>
          <addressOffset>0x0000010E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 4 Source Transfer Step Size Register</description>
          <addressOffset>0x00000110</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_TRANSFER_STEP</name>
          <description>DMA Channel 4 Destination Transfer Step Size Register</description>
          <addressOffset>0x00000112</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_WRAP_SIZE</name>
          <description>DMA Channel 4 Source Wrap Size Register</description>
          <addressOffset>0x00000114</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_WRAP_COUNT</name>
          <description>DMA Channel 4 Source Wrap Count Register</description>
          <addressOffset>0x00000116</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_WRAP_STEP</name>
          <description>DMA Channel 4 Source Wrap Step Size Register</description>
          <addressOffset>0x00000118</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_WRAP_SIZE</name>
          <description>DMA Channel 4 Destination Wrap Size Register</description>
          <addressOffset>0x0000011A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_WRAP_COUNT</name>
          <description>DMA Channel 4 Destination Wrap Count Register</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_WRAP_STEP</name>
          <description>DMA Channel 4 Destination Wrap Step Size Register</description>
          <addressOffset>0x0000011E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 4 Shadow Source Begin Register</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 4 Shadow Source Current Address Register</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 4 Active Source Begin Register</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 4 Active Source Current Address Register</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 4 Shadow Destination Begin Register</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_ADDR_SHADOW</name>
          <description>DMA Channel 4 Shadow Destination Current Address Register</description>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 4 Active Destination Begin Register</description>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 4 Active Destination Current Address Register</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_MODE</name>
          <description>DMA Channel 5 Mode Register</description>
          <addressOffset>0x00000140</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_CONTROL</name>
          <description>DMA Channel 5 Control Register</description>
          <addressOffset>0x00000142</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_BURST_SIZE</name>
          <description>DMA Channel 5 Burst Size Register</description>
          <addressOffset>0x00000144</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_BURST_COUNT</name>
          <description>DMA Channel 5 Burst Count Register</description>
          <addressOffset>0x00000146</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_BURST_STEP</name>
          <description>DMA Channel 5 Source Burst Step Size Register</description>
          <addressOffset>0x00000148</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_BURST_STEP</name>
          <description>DMA Channel 5 Destination Burst Step Size Register</description>
          <addressOffset>0x0000014A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_TRANSFER_SIZE</name>
          <description>DMA Channel 5 Transfer Size Register</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_TRANSFER_COUNT</name>
          <description>DMA Channel 5 Transfer Count Register</description>
          <addressOffset>0x0000014E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 5 Source Transfer Step Size Register</description>
          <addressOffset>0x00000150</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_TRANSFER_STEP</name>
          <description>DMA Channel 5 Destination Transfer Step Size Register</description>
          <addressOffset>0x00000152</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_WRAP_SIZE</name>
          <description>DMA Channel 5 Source Wrap Size Register</description>
          <addressOffset>0x00000154</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_WRAP_COUNT</name>
          <description>DMA Channel 5 Source Wrap Count Register</description>
          <addressOffset>0x00000156</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_WRAP_STEP</name>
          <description>DMA Channel 5 Source Wrap Step Size Register</description>
          <addressOffset>0x00000158</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_WRAP_SIZE</name>
          <description>DMA Channel 5 Destination Wrap Size Register</description>
          <addressOffset>0x0000015A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_WRAP_COUNT</name>
          <description>DMA Channel 5 Destination Wrap Count Register</description>
          <addressOffset>0x0000015C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_WRAP_STEP</name>
          <description>DMA Channel 5 Destination Wrap Step Size Register</description>
          <addressOffset>0x0000015E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 5 Shadow Source Begin Register</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 5 Shadow Source Current Address Register</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 5 Active Source Begin Register</description>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 5 Active Source Current Address Register</description>
          <addressOffset>0x0000016C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 5 Shadow Destination Begin Register</description>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_ADDR_SHADOW</name>
          <description>DMA Channel 5 Shadow Destination Current Address Register</description>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 5 Active Destination Begin Register</description>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 5 Active Destination Current Address Register</description>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_MODE</name>
          <description>DMA Channel 6 Mode Register</description>
          <addressOffset>0x00000180</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_CONTROL</name>
          <description>DMA Channel 6 Control Register</description>
          <addressOffset>0x00000182</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_BURST_SIZE</name>
          <description>DMA Channel 6 Burst Size Register</description>
          <addressOffset>0x00000184</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_BURST_COUNT</name>
          <description>DMA Channel 6 Burst Count Register</description>
          <addressOffset>0x00000186</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_BURST_STEP</name>
          <description>DMA Channel 6 Source Burst Step Size Register</description>
          <addressOffset>0x00000188</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
