xsession/openocd/svd/ti/tms320f28069.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CLA0NOTVISIBLE</name>
      <description>CLA0NOTVISIBLE</description>
      <groupName>CLA0NOTVISIBLE</groupName>
      <baseAddress>0x00002800</baseAddress>
      <registers>
        <register>
          <name>MPISRCSEL2</name>
          <description>Peripheral Interrupt Source Select Register 2</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MIPCTL</name>
          <description>Interrupt Prioriry Register</description>
          <addressOffset>0x0000004E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>MDEBUGCTL</name>
          <description>Legacy CLA Debug Control Register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>MDEBUGSS</name>
          <description>Legacy CLA Debug Single Step Register</description>
          <addressOffset>0x00000082</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>MPSACTL</name>
          <description>CLA PSA Control Register</description>
          <addressOffset>0x00000084</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>MPSA1</name>
          <description>CLA PSA Register 1</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MPSA2</name>
          <description>CLA PSA Register 2</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MHWADBGCAP</name>
          <description>TI HWA Debug Capabilities</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MHWADBGCTL</name>
          <description>TI HWA Debug Control</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USB0</name>
      <description>USB Registers</description>
      <groupName>USB</groupName>
      <baseAddress>0x00008000</baseAddress>
      <registers>
        <register>
          <name>USB_FADDR_POWER</name>
          <description>USB FADDR and POWER</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBFADDR</name>
              <description>USB Device Functional Address</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBFPOWER</name>
              <description>USB Power</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTXIS</name>
          <description>USB Transmit Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USBRXIS</name>
          <description>USB Receive Interrupt Status</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USBTXIE</name>
          <description>USB Transmit Interrupt Enable</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USBRXIE</name>
          <description>USB Receive Interrupt Enable</description>
          <addressOffset>0x00000010</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_IS_IE</name>
          <description>USB IS and IE</description>
          <addressOffset>0x00000014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBIS</name>
              <description>USB General Interrupt Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBIE</name>
              <description>USB Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFRAME</name>
          <description>USB Frame Value</description>
          <addressOffset>0x00000018</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_EPIDX_TEST</name>
          <description>USB EPIDX and TEST</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBEPIDX</name>
              <description>USB Endpoint Index</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTEST</name>
              <description>USB Test Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFIFO0</name>
          <description>USB FIFO Endpoint 0</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBFIFO1</name>
          <description>USB FIFO Endpoint 1</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBFIFO2</name>
          <description>USB FIFO Endpoint 2</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBFIFO3</name>
          <description>USB FIFO Endpoint 3</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBDEVCTL</name>
          <description>USB DEVCTL</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBDEVCTL</name>
              <description>USB Endpoint Index</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFIFOSZ_RXFIFSZ</name>
          <description>USB TXFIFOSZ and RXFIFSZ</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXFIFOSZ</name>
              <description>USB Transmit Dynamic FIFO Sizing</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRXFIFOSZ</name>
              <description>USB Receive Dynamic FIFO Sizing</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTXFIFOADD</name>
          <description>USB Transmit FIFO Start Address</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USBRXFIFOADD</name>
          <description>USB Receive FIFO Start Address</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_CONTIM_VPLEN</name>
          <description>USB CONTIM and VPLEN</description>
          <addressOffset>0x000000F4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBCONTIM</name>
              <description>USB Connect Timin</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBVPLEN</name>
              <description>USB OTG VBUS Pulse Timing</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFSEOF</name>
          <description>USBFSEOFF</description>
          <addressOffset>0x000000F8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBFSEOF</name>
              <description>USB Full-Speed Last Transaction to End of Frame Timing</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBLSEOF</name>
          <description>USBLSEOF</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBLSEOF</name>
              <description>USB Low-Speed Last Transaction to End of Frame Timing</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTXFUNCADDR0</name>
          <description>USBTXFUNCADDR0</description>
          <addressOffset>0x00000100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXFUNCADDR0</name>
              <description>USB Transmit Functional Address Endpoint 0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR0_TXHUBPORT0</name>
          <description>USB TXHUBADDR0 and TXHUBPORT0</description>
          <addressOffset>0x00000104</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXHUBADDR0</name>
              <description>USB Transmit Hub Address Endpoint 0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTXHUBPORT0</name>
              <description>USB Transmit Hub Port Endpoint 0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTXFUNCADDR1</name>
          <description>USBTXFUNCADDR1</description>
          <addressOffset>0x00000110</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXFUNCADDR1</name>
              <description>USB Transmit Functional Address Endpoint 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR1_TXHUBPORT1</name>
          <description>USB TXHUBADDR1 and TXHUBPORT1</description>
          <addressOffset>0x00000114</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXHUBADDR1</name>
              <description>USB Transmit Hub Address Endpoint 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTXHUBPORT1</name>
              <description>USB Transmit Hub Port Endpoint 1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBRXFUNCADDR1</name>
          <description>USBRXFUNCADDR1</description>
          <addressOffset>0x00000118</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXFUNCADDR1</name>
              <description>USB Receive Functional Address Endpoint 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR1_RXHUBPORT1</name>
          <description>USB RXHUBADDR1 and RXHUBPORT1</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBRXHUBADDR1</name>
              <description>USB Receive Hub Address Endpoint 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRXHUBPORT1</name>
              <description>USB Receive Hub Port Endpoint 1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTXFUNCADDR2</name>
          <description>USBTXFUNCADDR2</description>
          <addressOffset>0x00000120</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXFUNCADDR2</name>
              <description>USB Transmit Functional Address Endpoint 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR2_TXHUBPORT2</name>
          <description>USB TXHUBADDR2 and TXHUBPORT2</description>
          <addressOffset>0x00000124</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXHUBADDR2</name>
              <description>USB Transmit Hub Address Endpoint 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTXHUBPORT2</name>
              <description>USB Transmit Hub Port Endpoint 2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBRXFUNCADDR2</name>
          <description>USBRXFUNCADDR2</description>
          <addressOffset>0x00000128</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXFUNCADDR2</name>
              <description>USB Receive Functional Address Endpoint 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR2_RXHUBPORT2</name>
          <description>USB RXHUBADDR2 and RXHUBPORT2</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBRXHUBADDR2</name>
              <description>USB Receive Hub Address Endpoint 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRXHUBPORT2</name>
              <description>USB Receive Hub Port Endpoint 2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTXFUNCADDR3</name>
          <description>USBTXFUNCADDR3</description>
          <addressOffset>0x00000130</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXFUNCADDR3</name>
              <description>USB Transmit Functional Address Endpoint 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR3_TXHUBPORT3</name>
          <description>USB TXHUBADDR3 and TXHUBPORT3</description>
          <addressOffset>0x00000134</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXHUBADDR3</name>
              <description>USB Transmit Hub Address Endpoint 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTXHUBPORT3</name>
              <description>USB Transmit Hub Port Endpoint 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBRXFUNCADDR3</name>
          <description>USBRXFUNCADDR3</description>
          <addressOffset>0x00000138</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXFUNCADDR3</name>
              <description>USB Receive Functional Address Endpoint 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
