xsession/openocd/svd/ti/tms320f28069.svd
        <register>
          <name>USB_RXHUBADDR3_RXHUBPORT3</name>
          <description>USB RXHUBADDR3 and RXHUBPORT3</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBRXHUBADDR3</name>
              <description>USB Receive Hub Address Endpoint 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRXHUBPORT3</name>
              <description>USB Receive Hub Port Endpoint 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CSRL0_CSRH0</name>
          <description>USB CSRL0 and CSRH0</description>
          <addressOffset>0x00000204</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBCSRL0</name>
              <description>USB Control and Status Endpoint 0 Low</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBCSRH0</name>
              <description>USB Control and Status Endpoint 0 High</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBCOUNT0</name>
          <description>USBCOUNT0</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBCOUNT0</name>
              <description>USB Receive Byte Count Endpoint 0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TYPE0_NAKLMT</name>
          <description>USB TYPE0 and NAKLMT</description>
          <addressOffset>0x00000210</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTYPE0</name>
              <description>USB Type Endpoint 0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBNAKLMT</name>
              <description>USB NAK Limit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTXMAXP1</name>
          <description>USB Maximum Transmit Data Endpoint 1</description>
          <addressOffset>0x00000220</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_TXCSRL1_TXCSRH1</name>
          <description>USB TXCSRL1 and TXCSRH1</description>
          <addressOffset>0x00000224</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXCSRL1</name>
              <description>USB Transmit Control and Status Endpoint 1 Low</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTXCSRH1</name>
              <description>USB Transmit Control and Status Endpoint 1 High</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBRXMAXP1</name>
          <description>USB Maximum Receive Data Endpoint 1</description>
          <addressOffset>0x00000228</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_RXCSRL1_RXCSRH1</name>
          <description>USB RXCSRL1 and RXCSRH1</description>
          <addressOffset>0x0000022C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBRXCSRL1</name>
              <description>USB Receive Control and Status Endpoint 1 Low</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRXCSRH1</name>
              <description>USB Receive Control and Status Endpoint 1 High</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBRXCOUNT1</name>
          <description>USB Receive Byte Count Endpoint 1</description>
          <addressOffset>0x00000230</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_TXTYPE1_TXINTERVAL1</name>
          <description>USB TXTYPE1 and TXINTERVAL1</description>
          <addressOffset>0x00000234</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXTYPE1</name>
              <description>USB Host Transmit Configure Type Endpoint 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTXINTERVAL1</name>
              <description>USB Host Transmit Interval Endpoint 1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXTYPE1_RXINTERVAL1</name>
          <description>USB RXTYPE1 and RXINTERVAL1</description>
          <addressOffset>0x00000238</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBRXTYPE1</name>
              <description>USB Host Receive Configure Type Endpoint 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRXINTERVAL1</name>
              <description>USB Host Receive Interval Endpoint 1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTXMAXP2</name>
          <description>USB Maximum Transmit Data Endpoint 2</description>
          <addressOffset>0x00000240</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_TXCSRL2_TXCSRH2</name>
          <description>USB TXCSRL2 and TXCSRH2</description>
          <addressOffset>0x00000244</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXCSRL2</name>
              <description>USB Transmit Control and Status Endpoint 2 Low</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTXCSRH2</name>
              <description>USB Transmit Control and Status Endpoint 2 High</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBRXMAXP2</name>
          <description>USB Maximum Receive Data Endpoint 2</description>
          <addressOffset>0x00000248</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_RXCSRL2_RXCSRH2</name>
          <description>USB RXCSRL2 and RXCSRH2</description>
          <addressOffset>0x0000024C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBRXCSRL2</name>
              <description>USB Receive Control and Status Endpoint 2 Low</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRXCSRH2</name>
              <description>USB Receive Control and Status Endpoint 2 High</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBRXCOUNT2</name>
          <description>USB Receive Byte Count Endpoint 2</description>
          <addressOffset>0x00000250</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_TXTYPE2_TXINTERVAL2</name>
          <description>USB TXTYPE2 and TXINTERVAL2</description>
          <addressOffset>0x00000254</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXTYPE2</name>
              <description>USB Host Transmit Configure Type Endpoint 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTXINTERVAL2</name>
              <description>USB Host Transmit Interval Endpoint 2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXTYPE2_RXINTERVAL2</name>
          <description>USB RXTYPE2 and RXINTERVAL2</description>
          <addressOffset>0x00000258</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBRXTYPE2</name>
              <description>USB Host Receive Configure Type Endpoint 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRXINTERVAL2</name>
              <description>USB Host Receive Interval Endpoint 2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTXMAXP3</name>
          <description>USB Maximum Transmit Data Endpoint 3</description>
          <addressOffset>0x00000260</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_TXCSRL3_TXCSRH3</name>
          <description>USB TXCSRL32 and TXCSRH3</description>
          <addressOffset>0x00000264</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXCSRL3</name>
              <description>USB Transmit Control and Status Endpoint 3 Low</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTXCSRH3</name>
              <description>USB Transmit Control and Status Endpoint 3 High</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBRXMAXP3</name>
          <description>USB Maximum Receive Data Endpoint 3</description>
          <addressOffset>0x00000268</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_RXCSRL3_RXCSRH3</name>
          <description>USB RXCSRL3 and RXCSRH3</description>
          <addressOffset>0x0000026C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBRXCSRL3</name>
              <description>USB Receive Control and Status Endpoint 3 Low</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRXCSRH3</name>
              <description>USB Receive Control and Status Endpoint 3 High</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBRXCOUNT3</name>
          <description>USB Receive Byte Count Endpoint 3</description>
          <addressOffset>0x00000270</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USB_TXTYPE3_TXINTERVAL3</name>
          <description>USB TXTYPE3 and TXINTERVAL3</description>
          <addressOffset>0x00000274</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBTXTYPE3</name>
              <description>USB Host Transmit Configure Type Endpoint 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTXINTERVAL3</name>
              <description>USB Host Transmit Interval Endpoint 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXTYPE3_RXINTERVAL3</name>
          <description>USB RXTYPE3 and RXINTERVAL3</description>
          <addressOffset>0x00000278</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USBRXTYPE3</name>
              <description>USB Host Receive Configure Type Endpoint 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRXINTERVAL3</name>
              <description>USB Host Receive Interval Endpoint 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBRQPKTCOUNT1</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 1</description>
          <addressOffset>0x00000608</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USBRQPKTCOUNT2</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 2</description>
          <addressOffset>0x00000610</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USBRQPKTCOUNT3</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 3</description>
          <addressOffset>0x00000618</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USBRXDPKTBUFDIS</name>
          <description>USB Receive Double Packet Buffer Disable</description>
          <addressOffset>0x00000680</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USBTXDPKTBUFDIS</name>
          <description>USB Transmit Double Packet Buffer Disable</description>
          <addressOffset>0x00000684</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>USBEPC</name>
          <description>USB External Power Control</description>
          <addressOffset>0x00000800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBEPCRIS</name>
          <description>USB External Power Control Raw Interrupt Status</description>
          <addressOffset>0x00000808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBEPCIM</name>
          <description>USB External Power Control Interrupt Mask</description>
          <addressOffset>0x00000810</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBEPCISC</name>
          <description>USB External Power Control Interrupt Status and Clear</description>
          <addressOffset>0x00000818</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBDRRIS</name>
          <description>USB Device RESUME Raw Interrupt Status</description>
          <addressOffset>0x00000820</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBDRIM</name>
          <description>USB Device RESUME Interrupt Mask</description>
          <addressOffset>0x00000828</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBDRISC</name>
          <description>USB Device RESUME Interrupt Status and Clear</description>
          <addressOffset>0x00000830</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBGPCS</name>
          <description>USB General-Purpose Control and Status</description>
          <addressOffset>0x00000838</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBVDC</name>
          <description>USB VBUS Droop Control</description>
          <addressOffset>0x00000860</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBVDCRIS</name>
          <description>USB VBUS Droop Control Raw Interrupt Status</description>
          <addressOffset>0x00000868</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBVDCIM</name>
          <description>USB VBUS Droop Control Interrupt Mask</description>
          <addressOffset>0x00000870</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>USBVDCISC</name>
          <description>USB VBUS Droop Control Interrupt Status and Clear</description>
          <addressOffset>0x00000878</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
