xsession/openocd/svd/ti/tms320f28069.svd
        <register>
          <name>MBX17_MSGID</name>
          <description>eCAN Mailbox 17 Message Identifier</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX17_MSGCTRL</name>
          <description>eCAN Mailbox 17 Message Control</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX17_MDL</name>
          <description>eCAN Mailbox 17 Message Data Low</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX17_MDH</name>
          <description>eCAN Mailbox 17 Message Data High</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX18_MSGID</name>
          <description>eCAN Mailbox 18 Message Identifier</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX18_MSGCTRL</name>
          <description>eCAN Mailbox 18 Message Control</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX18_MDL</name>
          <description>eCAN Mailbox 18 Message Data Low</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX18_MDH</name>
          <description>eCAN Mailbox 18 Message Data High</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX19_MSGID</name>
          <description>eCAN Mailbox 19 Message Identifier</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX19_MSGCTRL</name>
          <description>eCAN Mailbox 19 Message Control</description>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX19_MDL</name>
          <description>eCAN Mailbox 19 Message Data Low</description>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX19_MDH</name>
          <description>eCAN Mailbox 19 Message Data High</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX20_MSGID</name>
          <description>eCAN Mailbox 20 Message Identifier</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX20_MSGCTRL</name>
          <description>eCAN Mailbox 20 Message Control</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX20_MDL</name>
          <description>eCAN Mailbox 20 Message Data Low</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX20_MDH</name>
          <description>eCAN Mailbox 20 Message Data High</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX21_MSGID</name>
          <description>eCAN Mailbox 21 Message Identifier</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX21_MSGCTRL</name>
          <description>eCAN Mailbox 21 Message Control</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX21_MDL</name>
          <description>eCAN Mailbox 21 Message Data Low</description>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX21_MDH</name>
          <description>eCAN Mailbox 21 Message Data High</description>
          <addressOffset>0x0000015C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX22_MSGID</name>
          <description>eCAN Mailbox 22 Message Identifier</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX22_MSGCTRL</name>
          <description>eCAN Mailbox 22 Message Control</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX22_MDL</name>
          <description>eCAN Mailbox 22 Message Data Low</description>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX22_MDH</name>
          <description>eCAN Mailbox 22 Message Data High</description>
          <addressOffset>0x0000016C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX23_MSGID</name>
          <description>eCAN Mailbox 23 Message Identifier</description>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX23_MSGCTRL</name>
          <description>eCAN Mailbox 23 Message Control</description>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX23_MDL</name>
          <description>eCAN Mailbox 23 Message Data Low</description>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX23_MDH</name>
          <description>eCAN Mailbox 23 Message Data High</description>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX24_MSGID</name>
          <description>eCAN Mailbox 24 Message Identifier</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX24_MSGCTRL</name>
          <description>eCAN Mailbox 24 Message Control</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX24_MDL</name>
          <description>eCAN Mailbox 24 Message Data Low</description>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX24_MDH</name>
          <description>eCAN Mailbox 24 Message Data High</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX25_MSGID</name>
          <description>eCAN Mailbox 25 Message Identifier</description>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX25_MSGCTRL</name>
          <description>eCAN Mailbox 25 Message Control</description>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX25_MDL</name>
          <description>eCAN Mailbox 25 Message Data Low</description>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX25_MDH</name>
          <description>eCAN Mailbox 25 Message Data High</description>
          <addressOffset>0x0000019C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX26_MSGID</name>
          <description>eCAN Mailbox 26 Message Identifier</description>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX26_MSGCTRL</name>
          <description>eCAN Mailbox 26 Message Control</description>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX26_MDL</name>
          <description>eCAN Mailbox 26 Message Data Low</description>
          <addressOffset>0x000001A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX26_MDH</name>
          <description>eCAN Mailbox 26 Message Data High</description>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX27_MSGID</name>
          <description>eCAN Mailbox 27 Message Identifier</description>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX27_MSGCTRL</name>
          <description>eCAN Mailbox 27 Message Control</description>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX27_MDL</name>
          <description>eCAN Mailbox 27 Message Data Low</description>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX27_MDH</name>
          <description>eCAN Mailbox 27 Message Data High</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX28_MSGID</name>
          <description>eCAN Mailbox 28 Message Identifier</description>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX28_MSGCTRL</name>
          <description>eCAN Mailbox 28 Message Control</description>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX28_MDL</name>
          <description>eCAN Mailbox 28 Message Data Low</description>
          <addressOffset>0x000001C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX28_MDH</name>
          <description>eCAN Mailbox 28 Message Data High</description>
          <addressOffset>0x000001CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX29_MSGID</name>
          <description>eCAN Mailbox 29 Message Identifier</description>
          <addressOffset>0x000001D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX29_MSGCTRL</name>
          <description>eCAN Mailbox 29 Message Control</description>
          <addressOffset>0x000001D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX29_MDL</name>
          <description>eCAN Mailbox 29 Message Data Low</description>
          <addressOffset>0x000001D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX29_MDH</name>
          <description>eCAN Mailbox 29 Message Data High</description>
          <addressOffset>0x000001DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX30_MSGID</name>
          <description>eCAN Mailbox 30 Message Identifier</description>
          <addressOffset>0x000001E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX30_MSGCTRL</name>
          <description>eCAN Mailbox 30 Message Control</description>
          <addressOffset>0x000001E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX30_MDL</name>
          <description>eCAN Mailbox 30 Message Data Low</description>
          <addressOffset>0x000001E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX30_MDH</name>
          <description>eCAN Mailbox 30 Message Data High</description>
          <addressOffset>0x000001EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX31_MSGID</name>
          <description>eCAN Mailbox 31 Message Identifier</description>
          <addressOffset>0x000001F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX31_MSGCTRL</name>
          <description>eCAN Mailbox 31 Message Control</description>
          <addressOffset>0x000001F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX31_MDL</name>
          <description>eCAN Mailbox 31 Message Data Low</description>
          <addressOffset>0x000001F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MBX31_MDH</name>
          <description>eCAN Mailbox 31 Message Data High</description>
          <addressOffset>0x000001FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
