xsession/openocd/svd/ti/tms320f28069.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HRCAP3</name>
      <description>HRCAP1 Registers</description>
      <groupName>HRCAP</groupName>
      <baseAddress>0x0000D900</baseAddress>
      <registers>
        <register>
          <name>HCCTL</name>
          <description>HRCAP Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCIFR</name>
          <description>HRCAP Interrupt Flag Register</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCICLR</name>
          <description>HRCAP Interrupt Clear Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCIFRC</name>
          <description>HRCAP Interrupt Force Register</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCCOUNTER</name>
          <description>HRCAP 16-bit Counter Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCCAPCNTRISE0</name>
          <description>HRCAP Capture Counter On Rising Edge 0 Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCCAPCNTFALL0</name>
          <description>HRCAP Capture Counter On Falling Edge 0 Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCCAPCNTRISE1</name>
          <description>HRCAP Capture Counter On Rising Edge 1 Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCCAPCNTFALL1</name>
          <description>HRCAP Capture Counter On Falling Edge 1 Register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>HRCAP4</name>
      <description>HRCAP1 Registers</description>
      <groupName>HRCAP</groupName>
      <baseAddress>0x0000D940</baseAddress>
      <registers>
        <register>
          <name>HCCTL</name>
          <description>HRCAP Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCIFR</name>
          <description>HRCAP Interrupt Flag Register</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCICLR</name>
          <description>HRCAP Interrupt Clear Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCIFRC</name>
          <description>HRCAP Interrupt Force Register</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCCOUNTER</name>
          <description>HRCAP 16-bit Counter Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCCAPCNTRISE0</name>
          <description>HRCAP Capture Counter On Rising Edge 0 Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCCAPCNTFALL0</name>
          <description>HRCAP Capture Counter On Falling Edge 0 Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCCAPCNTRISE1</name>
          <description>HRCAP Capture Counter On Rising Edge 1 Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HCCAPCNTFALL1</name>
          <description>HRCAP Capture Counter On Falling Edge 1 Register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
