xsession/openocd/svd/ti/tms320f28069.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWL</name>
      <description>PWL Locations</description>
      <groupName>PWL</groupName>
      <baseAddress>0x007EFFF0</baseAddress>
      <registers>
        <register>
          <name>PWL0</name>
          <description>CSM Password Location 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PWL1</name>
          <description>CSM Password Location 1</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PWL2</name>
          <description>CSM Password Location 2</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PWL3</name>
          <description>CSM Password Location 3</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PWL4</name>
          <description>CSM Password Location 4</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PWL5</name>
          <description>CSM Password Location 5</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PWL6</name>
          <description>CSM Password Location 6</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PWL7</name>
          <description>CSM Password Location 7</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <tiCore>C28X</tiCore>
    <tiAddressScale>2</tiAddressScale>
    <tiCortexDebugCompatible>false</tiCortexDebugCompatible>
    <tiProcessorName>c28x</tiProcessorName>
    <tiGenerator>ti-c2000-toolchain</tiGenerator>
  </vendorExtensions>
</device>